writing-source-code-cn.org
#+title: Emacs和它的朋友们--编写代码篇

这篇文章是 [[./reading-source-code-cn.html][Emacs和它的朋友们——阅读代码篇]] 的姐妹篇。值得注意的是，写代码
是比读代码广得多、难得多的一项任务——谁都可以读linux kernel的源代码，可
有多少人可以说自己对linux kernel有提交过多少行代码？（如果您是一位
kernel contributor，请不要往下读了，班门弄斧我会不好意思的:-）

所以，我对能不能写好这篇文章真的没有信心，但我保证一定会认真写。即使写
出来让人看笑话也不怕，因为我真的很认真哦！

* 打字快了不起啊？

选Emacs当编辑器的人，大概都是打字高手吧？因为如果打字跟蜗牛似的话，那选
这么强的编辑器，简直就浪费啊！

反正我就是这么认为的，所以我下了很大的力气去提高自己的打字速度。
