writing-source-code-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs和它的朋友们&ndash;编写代码篇</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Emacs和它的朋友们&ndash;编写代码篇"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-31 16:55:00 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emacs和它的朋友们&ndash;编写代码篇</h1>

<p>这篇文章是 <a href="./reading-source-code-cn.html">Emacs和它的朋友们——阅读代码篇</a> 的姐妹篇。值得注意的是，写代码
是比读代码广得多、难得多的一项任务——谁都可以读linux kernel的源代码，可
有多少人可以说自己对linux kernel有提交过多少行代码？（如果您是一位
kernel contributor，请不要往下读了，班门弄斧我会不好意思的:-）
</p>
<p>
所以，我对能不能写好这篇文章真的没有信心，但我保证一定会认真写。即使写
出来让人看笑话也不怕，因为我真的很认真哦！
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 打字快了不起啊？</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 打字快了不起啊？</h2>
<div class="outline-text-2" id="text-1">


<p>
选Emacs当编辑器的人，大概都是打字高手吧？因为如果打字跟蜗牛似的话，那选
这么强的编辑器，简直就浪费啊！
</p>
<p>
反正我就是这么认为的，所以我下了很大的力气去提高自己的打字速度。
</p></div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
